### Lamda Function : Anonymous Function: Unnamed Function

In [22]:
# lamda input_args... : expression
# in lamda, we can have only one expression here. You can have any number of input arguments. The expression is separated by a colon. 
# 1. It can take any number of input arguments. 
# 2. But can only have one expression to execute
# 
# The outcome of the expression will be returned as a value

import pandas as pd
import numpy as np

In [3]:
def addme(a,b):
    return a+b
res = addme(10,20)
print(res)

30

In [9]:
# We can now implement this same function  with lamda
addme2 = lambda a,b:a+b # (left side is the input argment, and the right side is the )
res = addme2(10,20) 
print(res)

30

In [12]:
# newer function to try
def addme(a,b):
    if a>b:
        return a-b
    else:
        return a+b
    
res = addme(20,150)
print(res)
res = addme(20,15)
print(res)

170
5

In [15]:
# same as above but with lambda
addme3 = lambda a,b:a-b if(a>b) else a+b

res3 = addme(20,15)
print(res3)
res4 = addme(10,15)
print(res4)

5
25

In [16]:
# map() values to a function from multiple iterable objects
# Syntax is: map(function_object, itr1, itr2, ....)

def map_addme(a,b):
    return a+b

map_addme(10,20)

30

In [18]:
# now with a list
def addme(a,b):
    return a+b
x=[1,2,3,4,5,6]
y=[6,5,4,3,2,1]

mobj = map(addme, x, y)

for val in mobj:
    print(val)

7
7
7
7
7
7

In [19]:
x=[2,2,3,4,5,6]
y=[6,5,4,3,2,1]
mobj2 = map(lambda a,b:a+b, x,y)
list(mobj2)

[8, 7, 7, 7, 7, 7]

In [20]:
### Replacing all the elements from one value to another also called as encoding
#1 - map() : map a dictionary key to its value
#2 - replace(old_element, new_element) : replaces the values in df column from list of old_elements to list of new_elements
#3 - get_dummies()

In [38]:
titanic_df = pd.read_csv('dataset/titanic.csv')
titanic_df.head()

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,3.0,NaN,NaN,26.0,0.0,0.0,NaN,7.9250,NaN,S
4,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S

In [34]:
titanic_df.shape

(895, 11)

In [35]:
titanic_df.isnull().sum()

survived      3
pclass        3
name          4
sex           4
age         180
sibsp         3
parch         3
ticket        4
fare          3
cabin       691
embarked      5
dtype: int64

In [39]:
titanic_df.drop('cabin', axis=1, inplace=True) # false by default, this will now actually update the variable titanic_df and reflect it, when you make inplace=True

In [40]:
titanic_df.isnull().sum() # shows all the values in the data frame that contains null (or NaN)

survived      3
pclass        3
name          4
sex           4
age         180
sibsp         3
parch         3
ticket        4
fare          3
embarked      5
dtype: int64

In [42]:
titanic_df.shape # one less column now

(895, 10)

In [43]:
titanic_df.head() # show the cabin column removed now

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked
0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,S
1,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.0,3.0,NaN,NaN,26.0,0.0,0.0,NaN,7.9250,S
4,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,S

In [44]:
# Drop all the rows that contains ALL the values that are missing
titanic_df.dropna(how='all', inplace=True) # by default for rows, if we want columns, then axis=1

In [45]:
titanic_df.isnull().sum() # now you can see all the empty rows that got removed

survived      0
pclass        0
name          1
sex           1
age         177
sibsp         0
parch         0
ticket        1
fare          0
embarked      2
dtype: int64

In [46]:
titanic_df.shape

(892, 10)

In [47]:
titanic_df.dropna(inplace=True) # dby default dropna means at least one missing position it will drop all the records

In [48]:
titanic_df.shape

(712, 10)

In [49]:
titanic_df.isnull().sum()

survived    0
pclass      0
name        0
sex         0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    0
dtype: int64

In [50]:
titanic_df

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked
0,0.0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,S
1,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C
4,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,S
6,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,S
8,0.0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...
889,0.0,3.0,"Rice, Mrs. William (Margaret Norton)",female,39.0,0.0,5.0,382652,29.1250,Q
890,0.0,2.0,"Montvila, Rev. Juozas",male,27.0,0.0,0.0,211536,13.0000,S
891,1.0,1.0,"Graham, Miss. Margaret Edith",female,19.0,0.0,0.0,112053,30.0000,S
893,1.0,1.0,"Behr, Mr. Karl Howell",male,26.0,0.0,0.0,111369,30.0000,C
894,0.0,3.0,"Dooley, Mr. Patrick",male,32.0,0.0,0.0,370376,7.7500,Q

In [56]:
titanic_df.drop(['name', 'ticket'], axis=1, inplace=True)

In [57]:
titanic_df['survived'].value_counts()

0.0    424
1.0    288
Name: survived, dtype: int64

In [58]:
# using cross tab, to show the breakdown of all who survived and didnt, between male and female
pd.crosstab(titanic_df['survived'], titanic_df['sex'])

sex       female  male
survived
0.0           64   360
1.0          195    93

In [59]:
titanic_df.groupby(by='pclass')[['survived']].count()

        survived
pclass
1.0          184
2.0          173
3.0          355

In [61]:
pd.crosstab([titanic_df['pclass'], titanic_df['sex']], titanic_df['survived']) # break it down even more granular, using pclass column from data set

survived       0.0  1.0
pclass sex
1.0    female    3   80
       male     61   40
2.0    female    6   68
       male     84   15
3.0    female   55   47
       male    215   38

In [62]:
newdf = titanic_df.copy()

In [63]:
newdf.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked
0       0.0     3.0    male  22.0    1.0    0.0   7.2500        S
1       1.0     1.0  female  38.0    1.0    0.0  71.2833        C
4       1.0     3.0  female  26.0    0.0    0.0   7.9250        S
6       1.0     1.0  female  35.0    1.0    0.0  53.1000        S
8       0.0     3.0    male  35.0    0.0    0.0   8.0500        S